{"inkVersion":21,"root":[["^This is the beginning of the visual novel demo, please give a warm welcome to...","\n","^Yuzu! ","#","^speaker yuzu","/#","\n","^I will be your host today to show you around here! Okay so what do we have on the menu...","\n","^Speaking about myself... showing the technical abilities of the engine... and.. that's all! So what do you want to know?","\n",{"->":"Choice"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Choice":[["ev","str","^Tell me about yourself","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Tell me about the engine","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^That's all","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ",{"->":"SelfIntro"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Engine"},"\n",{"#f":5}],"c-2":["^ ",{"->":"Ending"},"\n",{"#f":5}]}],{"#f":1}],"SelfIntro":["^So about me, I'm Yuzu! My body was kindly drawn by FractalStella (check him out on Twitter!), my favorite food are fruits and I dream to one day go to Goathland and-","\n","^Ah we are making me sign to continue, okay okay, so what do you want to know next?","\n",{"->":"Choice"},{"#f":1}],"Engine":["^So as you saw this engine allow to display text that will be displayed character by character until you click and properly fit it inside the window","\n","^You can also let the user choose what he want to do like the choice you saw before","\n","^The text is written in ink format and is using their Unity plugin to easy parse it","\n","^Now let's speak of the features from the buttons on the bottom right of your screen, we will start with the 'Skip' one","\n","^As its name says, it allow to skip text, try it, I'll ramble for a bit and stop you when I'm done","\n","^... Bah, baa-","\n","^Baah, baa, baaa","\n","^Baaaa, baaaa-","\n","^Baaaaaa","\n","^Baa, bah","\n","^Baaaa baa, baah","\n","^Baaa-","\n","^Baa, baaah","\n","^Baa baaaa-","\n","^Bah baa baaaaaa","\n","^Baaa...","\n","^Amazing isn't it? It feels like no time passed! ","#","^skip false","/#","\n","^Along with tha- ah, my paper is empty, well that's all for the technical parts, anything else you want to know?","\n",{"->":"Choice"},{"#f":1}],"Ending":["^That's for doing this demonstration, come back again soon!","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}