{"inkVersion":21,"root":[["^This is the beginning of the visual novel demo, please give a warm welcome to...","\n","^Yuzu! ","#","^speaker yuzu","/#","\n","^I will be your host today to show you around here! Okay so what do we have on the menu...","\n","^Speaking about myself... showing the technical abilities of the engine... and.. that's all! So what do you want to know?","\n",{"->":"Choice"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Choice":[["ev","str","^Tell me about yourself","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Tell me about Ink","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Tell me about the engine","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^That's all","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["^ ",{"->":"SelfIntro"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Ink"},"\n",{"#f":5}],"c-2":["^ ",{"->":"Engine"},"\n",{"#f":5}],"c-3":["^ ",{"->":"Ending"},"\n",{"#f":5}]}],{"#f":1}],"SelfIntro":["^So about me, I'm Yuzu! My favorite food are fruits and I dream to one day go to Goathland and-","\n","^Ah we are making me sign to continue, okay okay, so what do you want to know next?","\n",{"->":"Choice"},{"#f":1}],"Ink":["^Ink is a narrative scripting language that give a simple syntax to write down text and then allow it to be easily used programmatically thanks to a plugin","\n","^The role of the custom engine itself is then to use this plugin to properly display the text on screen, and this is what you end up seeing!","\n","^If you want to know more about it I highly suggest you to check https:","\n",{"->":"Choice"},{"#f":1}],"Engine":["^So you already saw the basic features of this engine, display text letter by letter, showing choices on screen...","\n","^But well, what would interest you is probably the others features what make it stand out more, so let's go through them!","\n","^We will speak about the buttons at the lower right corner of the screen","\n","^Let's start with the \"Skip\" button, as its name says, it allow to skip text, try it, I'll ramble for a bit and stop you when I'm done","\n","^... Bah, baa-","\n","^Baah, baa, baaa","\n","^Baaaa, baaaa-","\n","^Baaaaaa","\n","^Baa, bah","\n","^Baaaa baa, baah","\n","^Baaa-","\n","^Baa, baaah","\n","^Baa baaaa-","\n","^Bah baa baaaaaa","\n","^Baaa...","\n","^Amazing isn't it? It feels like no time passed! ","#","^skip false","/#","\n","^Along with tha- ah, my paper is empty, well that's all for the technical parts, anything else you want to know?","\n",{"->":"Choice"},{"#f":1}],"Ending":["^And that's it for this demonstration, things will be added over time so don't hesitate to come back","\n","^You'll be redirected to the main screen, check the others scenes too!","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}